'''
Создать класс TrafficLight (светофор) и определить у него один атрибут color (цвет) и метод running (запуск).
Атрибут реализовать как приватный. В рамках метода реализовать переключение светофора в режимы: красный, желтый,
зеленый. Продолжительность первого состояния (красный) составляет 7 секунд, второго (желтый) — 2 секунды, третьего
(зеленый) — на ваше усмотрение. Переключение между режимами должно осуществляться только в указанном порядке
(красный, желтый, зеленый). Проверить работу примера, создав экземпляр и вызвав описанный метод.
'''
import time


class TrafficLight:
    __color = 'красный'

    def running(self):
        while True:
            print(f"горит {self.__color}")
            if self.__color == 'красный':
                time.sleep(7)
                self.__color = 'жёлтый'
            elif self.__color == 'жёлтый':
                time.sleep(2)
                self.__color = 'зелёный'
            else:
                time.sleep(10)
                self.__color == 'красный'
                break
        pass

if __name__ == '__main__':
    my_traffic_light = TrafficLight()
    my_traffic_light.running()
